apache/nuttx/arch/arm/src/lpc54xx/lpc54_spi_master.c
/****************************************************************************
 * arch/arm/src/lpc54xx/lpc54_spi_master.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/* TODO:
 *
 *   - There are no interrupt driven transfers, only polled.  I don't
 *     consider this a significant problem because of the higher rate that
 *     would be necessary for interrupt driven transfers.
 *   - Integrate DMA transfers.  This is fairly important because it can
 *     a) improve the data transfer rates and b) free the CPU when the
 *     SPI driver would otherwise be stuck in a tight polling loop.
 */

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/types.h>
#include <stdint.h>
#include <stdbool.h>
#include <assert.h>
#include <errno.h>
#include <nuttx/debug.h>

#include <arch/board/board.h>
#include <nuttx/arch.h>
#include <nuttx/mutex.h>
#include <nuttx/spi/spi.h>

#include "arm_internal.h"
#include "hardware/lpc54_pinmux.h"
#include "hardware/lpc54_syscon.h"
#include "hardware/lpc54_flexcomm.h"
#include "hardware/lpc54_spi.h"
#include "lpc54_config.h"
#include "lpc54_enableclk.h"
#include "lpc54_gpio.h"
#include "lpc54_spi_master.h"

#ifdef HAVE_SPI_MASTER_DEVICE

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define SPI_DUMMYDATA8   0xff
#define SPI_DUMMYDATA16  0xffff

#define SPI_MINWIDTH     4
#ifdef CONFIG_LPC54_SPI_WIDEDATA
#  define SPI_MAXWIDTH   16
#else
#  define SPI_MAXWIDTH   8
#endif

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* This structure describes the state of the SSP driver */

struct lpc54_spidev_s
{
  struct spi_dev_s dev;       /* Externally visible part of the SPI interface */
  uintptr_t base;             /* Base address of Flexcomm registers */
  mutex_t lock;               /* Held while chip is selected for mutual exclusion */
  uint32_t fclock;            /* Flexcomm function clock frequency */
  uint32_t frequency;         /* Requested clock frequency */
  uint32_t actual;            /* Actual clock frequency */
  uint16_t irq;               /* Flexcomm IRQ number */
  uint8_t nbits;              /* Width of word in bits (SPI_MINWIDTH to SPI_MAXWIDTH) */
  uint8_t mode;               /* Mode 0,1,2,3 */
};

/* These structures describes the Rx side of an 8- or 16-bit SPI data
 * exchange.
 */

struct lpc54_rxtransfer8_s
{
  uint8_t *rxptr;         /* Pointer into receive buffer */
  unsigned int remaining; /* Bytes remaining in the receive buffer */
  unsigned int expected;  /* Bytes expected to be received */
};

#ifdef CONFIG_LPC54_SPI_WIDEDATA
struct lpc54_rxtransfer16_s
{
  uint16_t *rxptr;        /* Pointer into receive buffer */
  unsigned int remaining; /* Hwords remaining in the receive buffer */
  unsigned int expected;  /* Hwords expected to be received */
};
#endif

/* These structures describes the Tx side of an 8- or 16-bit SPI data
 * exchange.
 */

struct lpc54_txtransfer8_s
{
  uint32_t txctrl;        /* Tx control bits */
  const uint8_t *txptr;   /* Pointer into transmit buffer */
  unsigned int remaining; /* Bytes remaining in the transmit buffer */
};

#ifdef CONFIG_LPC54_SPI_WIDEDATA
struct lpc54_txtransfer16_s
{
  uint32_t txctrl;        /* Tx control bits */
  const uint16_t *txptr;  /* Pointer into transmit buffer */
  unsigned int remaining; /* Hwords remaining in the transmit buffer */
};
#endif

struct lpc54_txdummy_s
{
  uint32_t txctrl;        /* Tx control bits */
  unsigned int remaining; /* Bytes remaining in the transmit buffer */
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* Transfer helpers */

static inline size_t lpc54_spi_fifodepth(struct lpc54_spidev_s *priv);
static inline bool lpc54_spi_txavailable(struct lpc54_spidev_s *priv);
static inline bool lpc54_spi_rxavailable(struct lpc54_spidev_s *priv);

static void     lpc54_spi_resetfifos(struct lpc54_spidev_s *priv);
static void     lpc54_spi_rxtransfer8(struct lpc54_spidev_s *priv,
                  struct lpc54_rxtransfer8_s *xfr);
#ifdef CONFIG_LPC54_SPI_WIDEDATA
static void     lpc54_spi_rxtransfer16(struct lpc54_spidev_s *priv,
                  struct lpc54_rxtransfer16_s *xfr);
#endif
static bool     lpc54_spi_txtransfer8(struct lpc54_spidev_s *priv,
                  struct lpc54_txtransfer8_s *xfr);
#ifdef CONFIG_LPC54_SPI_WIDEDATA
static bool     lpc54_spi_txtransfer16(struct lpc54_spidev_s *priv,
                  struct lpc54_txtransfer16_s *xfr);
#endif
static bool     lpc54_spi_txdummy(struct lpc54_spidev_s *priv,
                  struct lpc54_txdummy_s *xfr);
#ifdef CONFIG_SPI_EXCHANGE
static void     lpc54_spi_exchange8(struct lpc54_spidev_s *priv,
                  const void *txbuffer, void *rxbuffer,
                  size_t nwords);
#ifdef CONFIG_LPC54_SPI_WIDEDATA
static void     lpc54_spi_exchange16(struct lpc54_spidev_s *priv,
                  const void *txbuffer, void *rxbuffer,
                  size_t nwords);
#endif
#endif
static void     lpc54_spi_sndblock8(struct lpc54_spidev_s *priv,
                  const void *buffer, size_t nwords);
#ifdef CONFIG_LPC54_SPI_WIDEDATA
static void     lpc54_spi_sndblock16(struct lpc54_spidev_s *priv,
                  const void *buffer, size_t nwords);
#endif
static void     lpc54_spi_recvblock8(struct lpc54_spidev_s *priv,
                  void *buffer, size_t nwords);
#ifdef CONFIG_LPC54_SPI_WIDEDATA
static void     lpc54_spi_recvblock16(struct lpc54_spidev_s *priv,
                  void *buffer, size_t nwords);
#endif

/* SPI methods */

static int      lpc54_spi_lock(struct spi_dev_s *dev, bool lock);
static uint32_t lpc54_spi_setfrequency(struct spi_dev_s *dev,
                  uint32_t frequency);
static void     lpc54_spi_setmode(struct spi_dev_s *dev,
                  enum spi_mode_e mode);
static void     lpc54_spi_setbits(struct spi_dev_s *dev, int nbits);
static uint32_t lpc54_spi_send(struct spi_dev_s *dev, uint32_t wd);
#ifdef CONFIG_SPI_EXCHANGE
static void     lpc54_spi_exchange(struct spi_dev_s *dev,
                  const void *txbuffer, void *rxbuffer,
                  size_t nwords);
#endif
static void     lpc54_spi_sndblock(struct spi_dev_s *dev,
                  const void *buffer, size_t nwords);
static void     lpc54_spi_recvblock(struct spi_dev_s *dev,
                  void *buffer, size_t nwords);

/****************************************************************************
 * Private Data
 ****************************************************************************/

#ifdef CONFIG_LPC54_SPI0_MASTER
static const struct spi_ops_s g_spi0_ops =
{
  .lock              = lpc54_spi_lock,
  .select            = lpc54_spi0_select,   /* Provided externally */
  .setfrequency      = lpc54_spi_setfrequency,
  .setmode           = lpc54_spi_setmode,
  .setbits           = lpc54_spi_setbits,
#ifdef CONFIG_SPI_HWFEATURES
  .hwfeatures        = NULL,                /* Not supported */
#endif
  .status            = lpc54_spi0_status,   /* Provided externally */
#ifdef CONFIG_SPI_CMDDATA
  .cmddata           = lpc54_spi0_cmddata,  /* Provided externally */
#endif
  .send              = lpc54_spi_send,
#ifdef CONFIG_SPI_EXCHANGE
  .exchange          = lpc54_spi_exchange,
#else
  .sndblock          = lpc54_spi_sndblock,
  .recvblock         = lpc54_spi_recvblock,
#endif
#ifdef CONFIG_SPI_CALLBACK
  .registercallback  = lpc54_spi0_register, /* Provided externally */
#else
  .registercallback  = NULL,                /* Not implemented */
#endif
};

