apache/nuttx/arch/arm/src/lpc54xx/lpc54_spi_master.c
static struct lpc54_spidev_s g_spi0_dev =
{
  .lock = NXMUTEX_INITIALIZER,
};
#endif

#ifdef CONFIG_LPC54_SPI1_MASTER
static const struct spi_ops_s g_spi1_ops =
{
  .lock              = lpc54_spi_lock,
  .select            = lpc54_spi1_select,   /* Provided externally */
  .setfrequency      = lpc54_spi_setfrequency,
  .setmode           = lpc54_spi_setmode,
  .setbits           = lpc54_spi_setbits,
#ifdef CONFIG_SPI_HWFEATURES
  .hwfeatures        = NULL,                /* Not supported */
#endif
  .status            = lpc54_spi1_status,   /* Provided externally */
#ifdef CONFIG_SPI_CMDDATA
  .cmddata           = lpc54_spi1_cmddata,  /* Provided externally */
#endif
  .send              = lpc54_spi_send,
#ifdef CONFIG_SPI_EXCHANGE
  .exchange          = lpc54_spi_exchange,
#else
  .sndblock          = lpc54_spi_sndblock,
  .recvblock         = lpc54_spi_recvblock,
#endif
#ifdef CONFIG_SPI_CALLBACK
  .registercallback  = lpc54_spi1_register, /* Provided externally */
#else
  .registercallback  = NULL,                /* Not implemented */
#endif
};

static struct lpc54_spidev_s g_spi1_dev =
{
  .lock = NXMUTEX_INITIALIZER,
};
#endif

#ifdef CONFIG_LPC54_SPI2_MASTER
static const struct spi_ops_s g_spi2_ops =
{
  .lock              = lpc54_spi_lock,
  .select            = lpc54_spi2_select,   /* Provided externally */
  .setfrequency      = lpc54_spi_setfrequency,
  .setmode           = lpc54_spi_setmode,
  .setbits           = lpc54_spi_setbits,
#ifdef CONFIG_SPI_HWFEATURES
  .hwfeatures        = NULL,                /* Not supported */
#endif
  .status            = lpc54_spi2_status,   /* Provided externally */
#ifdef CONFIG_SPI_CMDDATA
  .cmddata           = lpc54_spi2_cmddata,  /* Provided externally */
#endif
  .send              = lpc54_spi_send,
#ifdef CONFIG_SPI_EXCHANGE
  .exchange          = lpc54_spi_exchange,
#else
  .sndblock          = lpc54_spi_sndblock,
  .recvblock         = lpc54_spi_recvblock,
#endif
#ifdef CONFIG_SPI_CALLBACK
  .registercallback  = lpc54_spi2_register, /* Provided externally */
#else
  .registercallback  = NULL,                /* Not implemented */
#endif
};

static struct lpc54_spidev_s g_spi2_dev =
{
  .lock = NXMUTEX_INITIALIZER,
};
#endif

#ifdef CONFIG_LPC54_SPI3_MASTER
static const struct spi_ops_s g_spi3_ops =
{
  .lock              = lpc54_spi_lock,
  .select            = lpc54_spi3_select,   /* Provided externally */
  .setfrequency      = lpc54_spi_setfrequency,
  .setmode           = lpc54_spi_setmode,
  .setbits           = lpc54_spi_setbits,
#ifdef CONFIG_SPI_HWFEATURES
  .hwfeatures        = NULL,                /* Not supported */
#endif
  .status            = lpc54_spi3_status,   /* Provided externally */
#ifdef CONFIG_SPI_CMDDATA
  .cmddata           = lpc54_spi3_cmddata,  /* Provided externally */
#endif
  .send              = lpc54_spi_send,
#ifdef CONFIG_SPI_EXCHANGE
  .exchange          = lpc54_spi_exchange,
#else
  .sndblock          = lpc54_spi_sndblock,
  .recvblock         = lpc54_spi_recvblock,
#endif
#ifdef CONFIG_SPI_CALLBACK
  .registercallback  = lpc54_spi3_register, /* Provided externally */
#else
  .registercallback  = NULL,                /* Not implemented */
#endif
};

static struct lpc54_spidev_s g_spi3_dev =
{
  .lock = NXMUTEX_INITIALIZER,
};
#endif

#ifdef CONFIG_LPC54_SPI4_MASTER
static const struct spi_ops_s g_spi4_ops =
{
  .lock              = lpc54_spi_lock,
  .select            = lpc54_spi4_select,   /* Provided externally */
  .setfrequency      = lpc54_spi_setfrequency,
  .setmode           = lpc54_spi_setmode,
  .setbits           = lpc54_spi_setbits,
#ifdef CONFIG_SPI_HWFEATURES
  .hwfeatures        = NULL,                /* Not supported */
#endif
  .status            = lpc54_spi4_status,   /* Provided externally */
#ifdef CONFIG_SPI_CMDDATA
  .cmddata           = lpc54_spi4_cmddata,  /* Provided externally */
#endif
  .send              = lpc54_spi_send,
#ifdef CONFIG_SPI_EXCHANGE
  .exchange          = lpc54_spi_exchange,
#else
  .sndblock          = lpc54_spi_sndblock,
  .recvblock         = lpc54_spi_recvblock,
#endif
#ifdef CONFIG_SPI_CALLBACK
  .registercallback  = lpc54_spi4_register, /* Provided externally */
#else
  .registercallback  = NULL,                /* Not implemented */
#endif
};

static struct lpc54_spidev_s g_spi4_dev =
{
  .lock = NXMUTEX_INITIALIZER,
};
#endif

#ifdef CONFIG_LPC54_SPI5_MASTER
static const struct spi_ops_s g_spi5_ops =
{
  .lock              = lpc54_spi_lock,
  .select            = lpc54_spi5_select,   /* Provided externally */
  .setfrequency      = lpc54_spi_setfrequency,
  .setmode           = lpc54_spi_setmode,
  .setbits           = lpc54_spi_setbits,
#ifdef CONFIG_SPI_HWFEATURES
  .hwfeatures        = NULL,                /* Not supported */
#endif
  .status            = lpc54_spi5_status,   /* Provided externally */
#ifdef CONFIG_SPI_CMDDATA
  .cmddata           = lpc54_spi5_cmddata,  /* Provided externally */
#endif
  .send              = lpc54_spi_send,
#ifdef CONFIG_SPI_EXCHANGE
  .exchange          = lpc54_spi_exchange,
#else
  .sndblock          = lpc54_spi_sndblock,
  .recvblock         = lpc54_spi_recvblock,
#endif
#ifdef CONFIG_SPI_CALLBACK
  .registercallback  = lpc54_spi5_register, /* Provided externally */
#else
  .registercallback  = NULL,                /* Not implemented */
#endif
};

static struct lpc54_spidev_s g_spi5_dev =
{
  .lock = NXMUTEX_INITIALIZER,
};
#endif

#ifdef CONFIG_LPC54_SPI6_MASTER
static const struct spi_ops_s g_spi6_ops =
{
  .lock              = lpc54_spi_lock,
  .select            = lpc54_spi6_select,   /* Provided externally */
  .setfrequency      = lpc54_spi_setfrequency,
  .setmode           = lpc54_spi_setmode,
  .setbits           = lpc54_spi_setbits,
#ifdef CONFIG_SPI_HWFEATURES
  .hwfeatures        = NULL,                /* Not supported */
#endif
  .status            = lpc54_spi6_status,   /* Provided externally */
#ifdef CONFIG_SPI_CMDDATA
  .cmddata           = lpc54_spi6_cmddata,  /* Provided externally */
#endif
  .send              = lpc54_spi_send,
#ifdef CONFIG_SPI_EXCHANGE
  .exchange          = lpc54_spi_exchange,
#else
  .sndblock          = lpc54_spi_sndblock,
  .recvblock         = lpc54_spi_recvblock,
#endif
#ifdef CONFIG_SPI_CALLBACK
  .registercallback  = lpc54_spi6_register, /* Provided externally */
#else
  .registercallback  = NULL,                /* Not implemented */
#endif
};

static struct lpc54_spidev_s g_spi6_dev =
{
  .lock = NXMUTEX_INITIALIZER,
};
#endif

#ifdef CONFIG_LPC54_SPI7_MASTER
static const struct spi_ops_s g_spi7_ops =
{
  .lock              = lpc54_spi_lock,
  .select            = lpc54_spi7_select,   /* Provided externally */
  .setfrequency      = lpc54_spi_setfrequency,
  .setmode           = lpc54_spi_setmode,
  .setbits           = lpc54_spi_setbits,
#ifdef CONFIG_SPI_HWFEATURES
  .hwfeatures        = NULL,                /* Not supported */
#endif
  .status            = lpc54_spi7_status,   /* Provided externally */
#ifdef CONFIG_SPI_CMDDATA
  .cmddata           = lpc54_spi7_cmddata,  /* Provided externally */
#endif
  .send              = lpc54_spi_send,
#ifdef CONFIG_SPI_EXCHANGE
  .exchange          = lpc54_spi_exchange,
#else
  .sndblock          = lpc54_spi_sndblock,
  .recvblock         = lpc54_spi_recvblock,
#endif
#ifdef CONFIG_SPI_CALLBACK
  .registercallback  = lpc54_spi7_register, /* Provided externally */
#else
  .registercallback  = NULL,                /* Not implemented */
#endif
};

static struct lpc54_spidev_s g_spi7_dev =
{
  .lock = NXMUTEX_INITIALIZER,
};
#endif

#ifdef CONFIG_LPC54_SPI8_MASTER
static const struct spi_ops_s g_spi8_ops =
{
  .lock              = lpc54_spi_lock,
  .select            = lpc54_spi8_select,   /* Provided externally */
  .setfrequency      = lpc54_spi_setfrequency,
  .setmode           = lpc54_spi_setmode,
  .setbits           = lpc54_spi_setbits,
#ifdef CONFIG_SPI_HWFEATURES
  .hwfeatures        = NULL,                /* Not supported */
#endif
  .status            = lpc54_spi8_status,   /* Provided externally */
#ifdef CONFIG_SPI_CMDDATA
  .cmddata           = lpc54_spi8_cmddata,  /* Provided externally */
#endif
  .send              = lpc54_spi_send,
#ifdef CONFIG_SPI_EXCHANGE
  .exchange          = lpc54_spi_exchange,
#else
  .sndblock          = lpc54_spi_sndblock,
  .recvblock         = lpc54_spi_recvblock,
#endif
#ifdef CONFIG_SPI_CALLBACK
  .registercallback  = lpc54_spi8_register, /* Provided externally */
#else
  .registercallback  = NULL,                /* Not implemented */
#endif
};

static struct lpc54_spidev_s g_spi8_dev =
{
  .lock = NXMUTEX_INITIALIZER,
};
#endif

#ifdef CONFIG_LPC54_SPI9_MASTER
static const struct spi_ops_s g_spi9_ops =
{
  .lock              = lpc54_spi_lock,
  .select            = lpc54_spi9_select,   /* Provided externally */
  .setfrequency      = lpc54_spi_setfrequency,
  .setmode           = lpc54_spi_setmode,
  .setbits           = lpc54_spi_setbits,
#ifdef CONFIG_SPI_HWFEATURES
  .hwfeatures        = NULL,                /* Not supported */
#endif
  .status            = lpc54_spi9_status,   /* Provided externally */
#ifdef CONFIG_SPI_CMDDATA
  .cmddata           = lpc54_spi9_cmddata,  /* Provided externally */
#endif
  .send              = lpc54_spi_send,
#ifdef CONFIG_SPI_EXCHANGE
  .exchange          = lpc54_spi_exchange,
#else
  .sndblock          = lpc54_spi_sndblock,
  .recvblock         = lpc54_spi_recvblock,
#endif
#ifdef CONFIG_SPI_CALLBACK
  .registercallback  = lpc54_spi9_register, /* Provided externally */
#else
  .registercallback  = NULL,                /* Not implemented */
#endif
};

static struct lpc54_spidev_s g_spi9_dev =
{
  .lock = NXMUTEX_INITIALIZER,
};
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: lpc54_spi_putreg
 *
 * Description:
 *   Write a value to a register at the offset from the Flexcomm base.
 *
 ****************************************************************************/

static inline void lpc54_spi_putreg(struct lpc54_spidev_s *priv,
                                    unsigned int regoffset, uint32_t regval)
{
  putreg32(regval, priv->base + regoffset);
}

/****************************************************************************
 * Name: lpc54_spi_getreg
 *
 * Description:
 *   Read the content of a register at the offset from the Flexcomm base.
 *
 ****************************************************************************/

static inline uint32_t lpc54_spi_getreg(struct lpc54_spidev_s *priv,
                                        unsigned int regoffset)
{
  return getreg32(priv->base + regoffset);
}

/****************************************************************************
 * Name: lpc54_spi_fifodepth
 *
 * Description:
 *   Return the depth of the SPI FIFOs.  This is a constant value and could
 *   be hard coded.
 *
 * Input Parameters:
 *   priv - Device-specific state data
 *
 * Returned Value:
 *   The FIFO depth in words of the configured bit width.
 *
 ****************************************************************************/

static inline size_t lpc54_spi_fifodepth(struct lpc54_spidev_s *priv)
{
  uint32_t regval = lpc54_spi_getreg(priv, LPC54_SPI_FIFOCFG_OFFSET);
  return ((regval & SPI_FIFOCFG_SIZE_MASK) >> SPI_FIFOCFG_SIZE_SHIFT) << 3;
}

/****************************************************************************
 * Name: lpc54_spi_txavailable
 *
 * Description:
 *   Return true if the Tx FIFO is not full.
 *
 * Input Parameters:
 *   priv - Device-specific state data
 *
 * Returned Value:
 *   true: Tx FIFO is not full.
 *
 ****************************************************************************/

static inline bool lpc54_spi_txavailable(struct lpc54_spidev_s *priv)
{
  uint32_t regval = lpc54_spi_getreg(priv, LPC54_SPI_FIFOSTAT_OFFSET);
  return ((regval & SPI_FIFOSTAT_TXNOTFULL) != 0);
}

/****************************************************************************
 * Name: lpc54_spi_rxavailable
 *
 * Description:
 *   Return true if the Rx FIFO is not empty.
 *
 * Input Parameters:
 *   priv - Device-specific state data
 *
 * Returned Value:
 *   true: Rx FIFO is not empty.
 *
 ****************************************************************************/

static inline bool lpc54_spi_rxavailable(struct lpc54_spidev_s *priv)
{
  uint32_t regval = lpc54_spi_getreg(priv, LPC54_SPI_FIFOSTAT_OFFSET);
  return ((regval & SPI_FIFOSTAT_RXNOTEMPTY) != 0);
}

/****************************************************************************
 * Name: lpc54_spi_rxdiscard
 *
 * Description:
 *   Read and discard the data until the Rx FIFO is empty.
 *
 * Input Parameters:
 *   priv - Device-specific state data
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void lpc54_spi_rxdiscard(struct lpc54_spidev_s *priv)
{
  while (lpc54_spi_rxavailable(priv))
    {
      lpc54_spi_getreg(priv, LPC54_SPI_FIFORD_OFFSET);
    }
}

/****************************************************************************
 * Name: lpc54_spi_resetfifos
 *
 * Description:
 *   Clear Tx/Rx errors and empty FIFOs.
 *
 * Input Parameters:
 *   priv - Device-specific state data
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void lpc54_spi_resetfifos(struct lpc54_spidev_s *priv)
{
  uint32_t regval;

  /* Clear Tx/Rx errors and empty FIFOs */

