apache/nuttx/arch/arm/src/lpc54xx/lpc54_spi_master.c
  regval  = lpc54_spi_getreg(priv, LPC54_SPI_FIFOCFG_OFFSET);
  regval |= (SPI_FIFOCFG_EMPTYTX | SPI_FIFOCFG_EMPTYRX);
  lpc54_spi_putreg(priv, LPC54_SPI_FIFOCFG_OFFSET, regval);

  regval  = lpc54_spi_getreg(priv, LPC54_SPI_FIFOSTAT_OFFSET);
  regval |= (SPI_FIFOSTAT_TXERR | SPI_FIFOSTAT_RXERR);
  lpc54_spi_putreg(priv, LPC54_SPI_FIFOSTAT_OFFSET, regval);
}

/****************************************************************************
 * Name: lpc54_spi_rxtransfer8 and lpc54_spi_rxtransfer16
 *
 * Description:
 *   Receive one 8-bit or 16-bit value from the selected SPI device.
 *
 * Input Parameters:
 *   priv - Device-specific state data
 *   xfr  - Describes the Rx transfer
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void lpc54_spi_rxtransfer8(struct lpc54_spidev_s *priv,
                                  struct lpc54_rxtransfer8_s *xfr)
{
  /* Read one byte if available and expected */

  if (lpc54_spi_rxavailable(priv))
    {
      /* There is something in the Rx FIFO to be read.  Are we expecting
       * data in the Rx FIFO?  Is there space available in the Rx buffer?
       */

      if (xfr->expected == 0 || xfr->remaining == 0)
        {
          /* No..
           * then just read and discard the data until the Rx FIFO is empty
           */

          lpc54_spi_rxdiscard(priv);
          xfr->expected = 0;
        }
      else
        {
          /* Read and transfer one byte */

          *xfr->rxptr = lpc54_spi_getreg(priv, LPC54_SPI_FIFORD_OFFSET);

          /* Update pointers and counts */

          xfr->rxptr++;
          xfr->remaining--;
          xfr->expected--;
        }
    }
}

#ifdef CONFIG_LPC54_SPI_WIDEDATA
static void lpc54_spi_rxtransfer16(struct lpc54_spidev_s *priv,
                                   struct lpc54_rxtransfer16_s *xfr)
{
  /* Read one HWord if available and expected */

  if (lpc54_spi_rxavailable(priv))
    {
      /* There is something in the Rx FIFO to be read.  Are we expecting
       * data in the Rx FIFO?  Is there space available in the Rx buffer?
       */

      if (xfr->expected == 0 || xfr->remaining == 0)
        {
          /* No.. then just read and discard the data until the Rx FIFO
           * is empty.
           */

          lpc54_spi_rxdiscard(priv);
          xfr->expected = 0;
        }
      else
        {
          /* Read and transfer HWord */

          *xfr->rxptr = lpc54_spi_getreg(priv, LPC54_SPI_FIFORD_OFFSET);

          /* Update pointers and counts */

          xfr->rxptr++;
          xfr->remaining--;
          xfr->expected--;
        }
    }
}
#endif

/****************************************************************************
 * Name: lpc54_spi_txtransfer8 and lpc54_spi_txtransfer16
 *
 * Description:
 *   Send one 8- or 16-bit value to the selected SPI device.
 *
 * Input Parameters:
 *   priv - Device-specific state data
 *   xfr  - Describes the Tx transfer
 *
 * Returned Value:
 *   true:  The value was added to the TxFIFO
 *
 ****************************************************************************/

static bool lpc54_spi_txtransfer8(struct lpc54_spidev_s *priv,
                                  struct lpc54_txtransfer8_s *xfr)
{
  uint32_t regval;

  /* Transmit if txFIFO is not full and there is more Tx data to be sent */

  if (lpc54_spi_txavailable(priv) && xfr->remaining > 0)
    {
      /* Get the next byte to be sent */

      regval = *xfr->txptr;

      /* And send it */

      regval |= xfr->txctrl;
      lpc54_spi_putreg(priv, LPC54_SPI_FIFOWR_OFFSET, regval);

      /* Update pointers and counts */

      xfr->txptr++;
      xfr->remaining--;

      return true;
    }

  return false;
}

#ifdef CONFIG_LPC54_SPI_WIDEDATA
static bool lpc54_spi_txtransfer16(struct lpc54_spidev_s *priv,
                                   struct lpc54_txtransfer16_s *xfr)
{
  uint32_t regval;

  /* Transmit if txFIFO is not full and there is more Tx data to be sent */

  if (lpc54_spi_txavailable(priv) && xfr->remaining > 0)
    {
      /* Get the next byte to be sent */

      regval = *xfr->txptr;

      /* And send it */

      regval |= xfr->txctrl;
      lpc54_spi_putreg(priv, LPC54_SPI_FIFOWR_OFFSET, regval);

      /* Update pointers and counts */

      xfr->txptr++;
      xfr->remaining--;

      return true;
    }

  return false;
}
#endif

/****************************************************************************
 * Name: lpc54_spi_txdummy
 *
 * Description:
 *   Send dummy Tx data when we really only care about the Rx data.
 *
 * Input Parameters:
 *   priv - Device-specific state data
 *   xfr  - Describes the Tx transfer
 *
 * Returned Value:
 *   true:  The dummy value was added to the TxFIFO
 *
 ****************************************************************************/

static bool lpc54_spi_txdummy(struct lpc54_spidev_s *priv,
                              struct lpc54_txdummy_s *xfr)
{
  /* Transmit if txFIFO is not full and there is more Tx data to be sent */

  if (lpc54_spi_txavailable(priv) && xfr->remaining > 0)
    {
      /* Send the dummy data */

      lpc54_spi_putreg(priv, LPC54_SPI_FIFOWR_OFFSET, xfr->txctrl);

      /* Update counts */

      xfr->remaining--;
      return true;
    }

  return false;
}

/****************************************************************************
 * Name: lpc54_spi_exchange8 and lpc54_spi_exchange16
 *
 * Description:
 *   Implements the SPI exchange method for the case of 8-bit and 16-bit
 *   transfers.
 *
 * Input Parameters:
 *   priv     - Device-specific state data
 *   txbuffer - A pointer to the buffer of data to be sent
 *   rxbuffer - A pointer to a buffer in which to receive data
 *   nwords   - the length of data to be exchanged in units of words.
 *              The wordsize is determined by the number of bits-per-word
 *              selected for the SPI interface.  If nbits <= 8, the data is
 *              packed into uint8_t's; if nbits >8, the data is packed into
 *              uint16_t's
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

