apache/nuttx/arch/arm/src/lpc54xx/lpc54_spi_master.c
#ifdef CONFIG_SPI_EXCHANGE
static void lpc54_spi_exchange8(struct lpc54_spidev_s *priv,
                                const void *txbuffer, void *rxbuffer,
                                size_t nwords)
{
  struct lpc54_rxtransfer8_s rxtransfer;
  struct lpc54_txtransfer8_s txtransfer;
  size_t depth;

  DEBUGASSERT(rxbuffer != NULL && txbuffer != NULL);

  /* Get the FIFO depth */

  depth = lpc54_spi_fifodepth(priv);

  /* Set up the transfer data */

  txtransfer.txctrl = SPI_FIFOWR_LEN(priv->nbits) | SPI_FIFOWR_TXSSELN_ALL;
  txtransfer.txptr = (uint8_t *)txbuffer;
  txtransfer.remaining = nwords;
  rxtransfer.rxptr = (uint8_t *)rxbuffer;
  rxtransfer.remaining = nwords;
  rxtransfer.expected = 0;

  /* Clear Tx/Rx errors and empty FIFOs */

  lpc54_spi_resetfifos(priv);

  /* Loop until all Tx data has been sent and until all Rx data has been
   * received.
   */

  while (txtransfer.remaining != 0 || rxtransfer.remaining != 0)
    {
      /* Transfer one byte from the Rx FIFO to the caller's Rx buffer */

      lpc54_spi_rxtransfer8(priv, &rxtransfer);

      /* If sending another byte would exceed the capacity of the Rx FIFO
       * then read-only until there space freed.
       */

      if (rxtransfer.expected < depth)
        {
          /* Attempt to transfer one byte from the caller's Tx buffer to
           * the Tx FIFO.
           */

          if (lpc54_spi_txtransfer8(priv, &txtransfer))
            {
              /* Increment the Rx expected count if successful */

              rxtransfer.expected++;
            }
        }
    }
}
#endif /* CONFIG_SPI_EXCHANGE */

#if defined(CONFIG_SPI_EXCHANGE) && defined(CONFIG_LPC54_SPI_WIDEDATA)
static void lpc54_spi_exchange16(struct lpc54_spidev_s *priv,
                                 const void *txbuffer,
                                 void *rxbuffer,
                                 size_t nwords)
{
  struct lpc54_rxtransfer16_s rxtransfer;
  struct lpc54_txtransfer16_s txtransfer;
  uint32_t regval;
  size_t depth;

  DEBUGASSERT(rxbuffer != NULL && ((uintptr_t)rxbuffer & 1) == 0);
  DEBUGASSERT(txbuffer != NULL && ((uintptr_t)txbuffer & 1) == 0);

  /* Get the FIFO depth */

  depth = lpc54_spi_fifodepth(priv);

  /* Set up the transfer data */

  txtransfer.txctrl = SPI_FIFOWR_LEN(priv->nbits) | SPI_FIFOWR_TXSSELN_ALL;
  txtransfer.txptr = (uint16_t *)txbuffer;
  txtransfer.remaining = nwords;
  rxtransfer.rxptr = (uint16_t *)rxbuffer;
  rxtransfer.remaining = nwords;
  rxtransfer.expected = 0;

  /* Clear Tx/Rx errors and empty FIFOs */

  lpc54_spi_resetfifos(priv);

  /* Loop until all Tx data has been sent and until all Rx data has been
   * received.
   */

  while (txtransfer.remaining || rxtransfer.remaining || rxtransfer.expected)
    {
      /* Transfer one HWord from the Rx FIFO to the caller's Rx buffer */

      lpc54_spi_rxtransfer16(priv, &rxtransfer);

      /* If sending another byte would exceed the capacity of the Rx FIFO
       * then read-only until there space freed.
       */

      if (rxtransfer.expected < depth)
        {
          /* Attempt to send one more byte */

          if (lpc54_spi_txtransfer16(priv, &txtransfer))
            {
              /* Increment the Rx expected count if successful */

              rxtransfer.expected++;
            }
        }
    }
}
#endif /* CONFIG_SPI_EXCHANGE && CONFIG_LPC54_SPI_WIDEDATA */

/****************************************************************************
 * Name: lpc54_spi_sndblock8 and lpc54_spi_sndblock16
 *
 * Description:
 *   Implements the SPI sndblock method for the case of 8- and 16-bit
 *   transfers.
 *
 * Input Parameters:
 *   priv   - Device-specific state data
 *   buffer - A pointer to the buffer of data to be sent
 *   nwords - the length of data to send from the buffer in number of words.
 *            The wordsize is determined by the number of bits-per-word
 *            selected for the SPI interface.  If nbits <= 8, the data is
 *            packed into uint8_t's; if nbits >8, the data is packed into
 *            uint16_t's
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void lpc54_spi_sndblock8(struct lpc54_spidev_s *priv,
                                const void *buffer, size_t nwords)
{
  struct lpc54_txtransfer8_s txtransfer;

  DEBUGASSERT(buffer != NULL);

  /* Set up the transfer data.  NOTE that we are ignoring returned Rx data */

  txtransfer.txctrl    = SPI_FIFOWR_RXIGNORE | SPI_FIFOWR_LEN(priv->nbits) |
                         SPI_FIFOWR_TXSSELN_ALL;
  txtransfer.txptr     = (uint8_t *)buffer;
  txtransfer.remaining = nwords;

  /* Clear Tx/Rx errors and empty FIFOs */

  lpc54_spi_resetfifos(priv);

  /* Loop until all Tx data has been sent */

  while (txtransfer.remaining != 0)
    {
      /* Attempt to transfer one byte from the caller's Tx buffer to the
       * Tx FIFO.
       */

      lpc54_spi_txtransfer8(priv, &txtransfer);
    }
}

#ifdef CONFIG_LPC54_SPI_WIDEDATA
static void lpc54_spi_sndblock16(struct lpc54_spidev_s *priv,
                                 const void *buffer, size_t nwords)
{
  struct lpc54_txtransfer16_s txtransfer;

  DEBUGASSERT(buffer != NULL);

  /* Set up the transfer data.  NOTE that we are ignoring returned Rx data */

  txtransfer.txctrl    = SPI_FIFOWR_RXIGNORE | SPI_FIFOWR_LEN(priv->nbits) |
                         SPI_FIFOWR_TXSSELN_ALL;
  txtransfer.txptr     = (uint16_t *)buffer;
  txtransfer.remaining = nwords;

  /* Clear Tx/Rx errors and empty FIFOs */

  lpc54_spi_resetfifos(priv);

  /* Loop until all Tx data has been sent and until all Rx data has been
   * received.
   */

  while (txtransfer.remaining != 0)
    {
      /* Attempt to transfer one byte from the caller's Tx buffer to the
       * Tx FIFO.
       */

      lpc54_spi_txtransfer16(priv, &txtransfer);
    }
}
#endif /* CONFIG_LPC54_SPI_WIDEDATA */

/****************************************************************************
 * Name: lpc54_spi_recvblock8 and lpc54_spi_recvblock16
 *
 * Description:
 *   Implements the SPI recvblock method for the case of 8- and 16-bit
 *   transfers.
 *
 * Input Parameters:
 *   priv   - Device-specific state data
 *   buffer - A pointer to the buffer in which to receive data
 *   nwords - the length of data that can be received in the buffer in
 *            number of words.  The wordsize is determined by the number of
 *            bits-per-word selected for the SPI interface.  If nbits <= 8,
 *            the data is packed into uint8_t's; if nbits >8, the data is
 *            packed into uint16_t's
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

