apache/nuttx/arch/arm/src/lpc54xx/lpc54_spi_master.c
static void lpc54_spi_recvblock8(struct lpc54_spidev_s *priv,
                                 void *buffer, size_t nwords)
{
  struct lpc54_rxtransfer8_s rxtransfer;
  struct lpc54_txdummy_s txtransfer;
  size_t depth;

  DEBUGASSERT(buffer != NULL);

  /* Get the FIFO depth */

  depth = lpc54_spi_fifodepth(priv);

  /* Set up the transfer data */

  txtransfer.txctrl    = SPI_DUMMYDATA8 | SPI_FIFOWR_LEN(priv->nbits) |
                         SPI_FIFOWR_TXSSELN_ALL;
  txtransfer.remaining = nwords;
  rxtransfer.rxptr     = (uint8_t *)buffer;
  rxtransfer.remaining = nwords;
  rxtransfer.expected  = 0;

  /* Clear Tx/Rx errors and empty FIFOs */

  lpc54_spi_resetfifos(priv);

  /* Loop until all Tx data has been sent and until all Rx data has been
   * received.
   */

  while (txtransfer.remaining != 0 || rxtransfer.remaining != 0)
    {
      /* Transfer one byte from the Rx FIFO to the caller's Rx buffer */

      lpc54_spi_rxtransfer8(priv, &rxtransfer);

      /* If sending another byte would exceed the capacity of the Rx FIFO
       * then read-only until there space freed.
       */

      if (rxtransfer.expected < depth)
        {
          /* Attempt to transfer one dummy byte to the Tx FIFO. */

          if (lpc54_spi_txdummy(priv, &txtransfer))
            {
              /* Increment the Rx expected count if successful */

              rxtransfer.expected++;
            }
        }
    }
}

#ifdef CONFIG_LPC54_SPI_WIDEDATA
static void lpc54_spi_recvblock16(struct lpc54_spidev_s *priv,
                                  void *buffer, size_t nwords)
{
  struct lpc54_rxtransfer16_s rxtransfer;
  struct lpc54_txdummy_s txtransfer;
  size_t depth;

  DEBUGASSERT(buffer != NULL);

  /* Get the FIFO depth */

  depth = lpc54_spi_fifodepth(priv);

  /* Set up the transfer data */

  txtransfer.txctrl    = SPI_DUMMYDATA16 | SPI_FIFOWR_LEN(priv->nbits) |
                         SPI_FIFOWR_TXSSELN_ALL;
  txtransfer.remaining = nwords;
  rxtransfer.rxptr     = (uint16_t *)rxbuffer;
  rxtransfer.remaining = nwords;
  rxtransfer.expected  = 0;

  /* Clear Tx/Rx errors and empty FIFOs */

  lpc54_spi_resetfifos(priv);

  /* Loop until all Tx data has been sent and until all Rx data has been
   * received.
   */

  while (txtransfer.remaining || rxtransfer.remaining || rxtransfer.expected)
    {
      /* Transfer one HWord from the Rx FIFO to the caller's Rx buffer */

      lpc54_spi_rxtransfer16(priv, &rxtransfer);

      /* If sending another byte would exceed the capacity of the Rx FIFO
       * then read-only until there space freed.
       */

      if (rxtransfer.expected < depth)
        {
          /* Attempt to transfer one dummy HWord to the Tx FIFO. */

          if (lpc54_spi_txdummy(priv, &txtransfer))
            {
              /* Increment the Rx expected count if successful */

              rxtransfer.expected++;
            }
        }
    }
}
#endif /* CONFIG_LPC54_SPI_WIDEDATA */

/****************************************************************************
 * Name: lpc54_spi_lock
 *
 * Description:
 *   On SPI buses where there are multiple devices, it will be necessary to
 *   lock SPI to have exclusive access to the buses for a sequence of
 *   transfers.  The bus should be locked before the chip is selected. After
 *   locking the SPI bus, the caller should then also call the setfrequency,
 *   setbits, and setmode methods to make sure that the SPI is properly
 *   configured for the device.  If the SPI bus is being shared, then it
 *   may have been left in an incompatible state.
 *
 * Input Parameters:
 *   dev  - Device-specific state data
 *   lock - true: Lock spi bus, false: unlock SPI bus
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static int lpc54_spi_lock(struct spi_dev_s *dev, bool lock)
{
  struct lpc54_spidev_s *priv = (struct lpc54_spidev_s *)dev;
  int ret;

  if (lock)
    {
      ret = nxmutex_lock(&priv->lock);
    }
  else
    {
      ret = nxmutex_unlock(&priv->lock);
    }

  return ret;
}

/****************************************************************************
 * Name: lpc54_spi_setfrequency
 *
 * Description:
 *   Set the SPI frequency.
 *
 * Input Parameters:
 *   dev -       Device-specific state data
 *   frequency - The SPI frequency requested
 *
 * Returned Value:
 *   Returns the actual frequency selected
 *
 ****************************************************************************/

static uint32_t lpc54_spi_setfrequency(struct spi_dev_s *dev,
                                       uint32_t frequency)
{
  struct lpc54_spidev_s *priv = (struct lpc54_spidev_s *)dev;
  uint32_t divider;
  uint32_t actual;
  uint32_t regval;

  /* Check if the requested frequency is the same as the current frequency
   * selection.
   */

  DEBUGASSERT(priv != NULL && frequency <= priv->fclock / 2);

  if (priv->frequency == frequency)
    {
      /* We are already at this frequency.  Return the actual. */

      return priv->actual;
    }

  /* Set the new SPI frequency */

  divider = priv->fclock / frequency;
  if (divider > 0x10000)
    {
      divider = 0x10000;
    }

  regval  = lpc54_spi_getreg(priv, LPC54_SPI_DIV_OFFSET);
  regval &= ~SPI_DIV_MASK;
  regval |= SPI_DIV(divider);
  lpc54_spi_putreg(priv, LPC54_SPI_DIV_OFFSET, regval);

  /* Calculate the actual frequency */

  actual  = priv->fclock / divider;

  /* Save the frequency setting */

  priv->frequency = frequency;
  priv->actual    = actual;

  spiinfo("Frequency %d->%d\n", frequency, actual);
  return actual;
}

/****************************************************************************
 * Name: lpc54_spi_setmode
 *
 * Description:
 *   Set the SPI mode. Optional.  See enum spi_mode_e for mode definitions
 *
 * Input Parameters:
 *   dev -  Device-specific state data
 *   mode - The SPI mode requested
 *
 * Returned Value:
 *   none
 *
 ****************************************************************************/

