apache/nuttx/arch/arm/src/lpc54xx/lpc54_spi_master.c
static void lpc54_spi_setmode(struct spi_dev_s *dev,
                              enum spi_mode_e mode)
{
  struct lpc54_spidev_s *priv = (struct lpc54_spidev_s *)dev;
  uint32_t regval;

  /* Has the mode changed? */

  if (mode != priv->mode)
    {
      /* Yes... Set the new mode */

      regval  = lpc54_spi_getreg(priv, LPC54_SPI_CFG_OFFSET);
      regval &= ~(SPI_CFG_CPHA | SPI_CFG_CPOL);

      switch (mode)
        {
        case SPIDEV_MODE0: /* CPOL=0; CPHA=0 */
          break;

        case SPIDEV_MODE1: /* CPOL=0; CPHA=1 */
          regval |= SPI_CFG_CPHA;
          break;

        case SPIDEV_MODE2: /* CPOL=1; CPHA=0 */
          regval |= SPI_CFG_CPOL;
          break;

        case SPIDEV_MODE3: /* CPOL=1; CPHA=1 */
          regval |= (SPI_CFG_CPHA | SPI_CFG_CPOL);
          break;

        default:
          DEBUGPANIC();
          return;
        }

      lpc54_spi_putreg(priv, LPC54_SPI_CFG_OFFSET, regval);

      /* Save the mode so that subsequent re-configurations will be faster */

      priv->mode = mode;
    }
}

/****************************************************************************
 * Name: lpc54_spi_setbits
 *
 * Description:
 *   Set the number if bits per word.
 *
 * Input Parameters:
 *   dev   -  Device-specific state data
 *   nbits - The number of bits requests
 *
 * Returned Value:
 *   none
 *
 ****************************************************************************/

static void lpc54_spi_setbits(struct spi_dev_s *dev, int nbits)
{
  struct lpc54_spidev_s *priv = (struct lpc54_spidev_s *)dev;

  /* The valid range of bit selections is SPI_MINWIDTH through SPI_MAXWIDTH */

  DEBUGASSERT(priv != NULL && nbits >= SPI_MINWIDTH &&
              nbits <= SPI_MAXWIDTH);

  if (nbits >= SPI_MINWIDTH && nbits <= SPI_MAXWIDTH)
    {
      /* Save the selection.  It will be applied when data is transferred. */

      priv->nbits = nbits;
    }
}

/****************************************************************************
 * Name: lpc54_spi_send
 *
 * Description:
 *   Exchange one word on SPI
 *
 * Input Parameters:
 *   dev - Device-specific state data
 *   wd  - The word to send.  the size of the data is determined by the
 *         number of bits selected for the SPI interface.
 *
 * Returned Value:
 *   response
 *
 ****************************************************************************/

static uint32_t lpc54_spi_send(struct spi_dev_s *dev, uint32_t wd)
{
  struct lpc54_spidev_s *priv = (struct lpc54_spidev_s *)dev;
  uint32_t regval;

  DEBUGASSERT(priv != NULL);

  /* Clear Tx/Rx errors and empty FIFOs */

  lpc54_spi_resetfifos(priv);

  /* Send the word.  Since we just reset the FIFOs, we assume that the Tx
   * FIFO is not full and that the Rx FIFO is empty.
   */

  DEBUGASSERT(lpc54_spi_txavailable(priv) || !lpc54_spi_rxavailable(priv));

  regval = wd | SPI_FIFOWR_LEN(priv->nbits) | SPI_FIFOWR_TXSSELN_ALL;
  lpc54_spi_putreg(priv, LPC54_SPI_FIFOWR_OFFSET, regval);

  /* Wait for the Rx FIFO to become non-empty. */

  while (!lpc54_spi_rxavailable(priv))
    {
    }

  /* Then read and return the value from the Rx FIFO */

  return lpc54_spi_getreg(priv, LPC54_SPI_FIFORD_OFFSET);
}

/****************************************************************************
 * Name: lpc54_spi_exchange
 *
 * Description:
 *   Exchange a block of data on SPI
 *
 * Input Parameters:
 *   dev      - Device-specific state data
 *   txbuffer - A pointer to the buffer of data to be sent
 *   rxbuffer - A pointer to a buffer in which to receive data
 *   nwords   - the length of data to be exchanged in units of words.
 *              The wordsize is determined by the number of bits-per-word
 *              selected for the SPI interface.  If nbits <= 8, the data is
 *              packed into uint8_t's; if nbits >8, the data is packed into
 *              uint16_t's
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

#ifdef CONFIG_SPI_EXCHANGE
static void lpc54_spi_exchange(struct lpc54_spidev_s *priv,
                               const void *txbuffer, void *rxbuffer,
                               size_t nwords)
{
  struct lpc54_spidev_s *priv = (struct lpc54_spidev_s *)dev;

  DEBUGASSERT(priv != NULL);

  /* If there is no data sink, then handle this transfer with
   * lpc54_spi_sndblock().
   */

  if (rxbuffer == NULL)
    {
      lpc54_spi_sndblock(priv, txbuffer, nwords)
    }

  /* If there is no data source, then handle this transfer with
   * lpc54_spi_recvblock().
   */

  else if (txbuffer == NULL)
    {
      lpc54_spi_recvblock(priv, rxbuffer, nwords)
    }

#ifdef CONFIG_LPC54_SPI_WIDEDATA
  /* If the data with is > 8-bits, then handle this transfer with
   * lpc54_spi_exchange16().
   */

  else if (priv->nbits > 8)
    {
      lpc54_spi_exchange16(priv, txbuffer, rxbuffer, nwords);
    }
#endif

  /* Otherwise, let lpc54_spi_exchange8() do the job */

  else if (priv->nbits > 8)
    {
      lpc54_spi_exchange8(priv, txbuffer, rxbuffer, nwords);
    }
}
#endif /* CONFIG_SPI_EXCHANGE */

/****************************************************************************
 * Name: lpc54_spi_sndblock
 *
 * Description:
 *   Send a block of data on SPI
 *
 * Input Parameters:
 *   dev -    Device-specific state data
 *   buffer - A pointer to the buffer of data to be sent
 *   nwords - the length of data to send from the buffer in number of words.
 *            The wordsize is determined by the number of bits-per-word
 *            selected for the SPI interface.  If nbits <= 8, the data is
 *            packed into uint8_t's; if nbits >8, the data is packed into
 *            uint16_t's
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void lpc54_spi_sndblock(struct spi_dev_s *dev,
                               const void *buffer, size_t nwords)
{
  struct lpc54_spidev_s *priv = (struct lpc54_spidev_s *)dev;

  spiinfo("buffer=%p nwords=%d\n", buffer, nwords);
  DEBUGASSERT(priv != NULL && buffer != NULL);

#ifdef CONFIG_LPC54_SPI_WIDEDATA
  /* If the data with is > 8-bits, then handle this transfer with
   * lpc54_spi_sndblock16().
   */

