apache/nuttx/arch/arm/src/lpc54xx/lpc54_spi_master.c
  regval  = lpc54_spi_getreg(priv, LPC54_SPI_CFG_OFFSET);
  regval &= ~(SPI_CFG_ENABLE | SPI_CFG_LSBF | SPI_CFG_CPHA | SPI_CFG_CPOL |
              SPI_CFG_LOOP | SPI_CFG_SPOL0 | SPI_CFG_SPOL1 | SPI_CFG_SPOL2 |
              SPI_CFG_SPOL3);
  regval |= SPI_CFG_MASTER;
  lpc54_spi_putreg(priv, LPC54_SPI_CFG_OFFSET, regval);

  /* Enable FIFOs */

  regval  = lpc54_spi_getreg(priv, LPC54_SPI_FIFOCFG_OFFSET);
  regval |= (SPI_FIFOCFG_EMPTYTX | SPI_FIFOCFG_EMPTYRX);
  lpc54_spi_putreg(priv, LPC54_SPI_FIFOCFG_OFFSET, regval);

  regval |= (SPI_FIFOCFG_ENABLETX | SPI_FIFOCFG_ENABLERX);
  lpc54_spi_putreg(priv, LPC54_SPI_FIFOCFG_OFFSET, regval);

  /* Set FIFO trigger levels:  Empty for Tx FIFO; 1 word for RxFIFO */

  regval  = lpc54_spi_getreg(priv, LPC54_SPI_FIFOCFG_OFFSET);
  regval &= ~(SPI_FIFOTRIG_TXLVL_MASK | SPI_FIFOTRIG_RXLVL_MASK);
  regval |= (SPI_FIFOTRIG_TXLVL_EMPTY | SPI_FIFOTRIG_RXLVL_NOTEMPTY);

  /* Enable generation of interrupts for selected FIFO trigger levels */

  regval |= (SPI_FIFOTRIG_TXLVLENA | SPI_FIFOTRIG_RXLVLENA);
  lpc54_spi_putreg(priv, LPC54_SPI_FIFOCFG_OFFSET, regval);

  /* Set the delay configuration (not used) */

  regval = (SPI_DLY_PRE_DELAY(0) | SPI_DLY_POST_DELAY(0) |
            SPI_DLY_FRAME_DELAY(0) | SPI_DLY_TRANSFER_DELAY(0));
  lpc54_spi_putreg(priv, LPC54_SPI_DLY_OFFSET, regval);

  /* Select a default frequency of approx. 400KHz */

  lpc54_spi_setfrequency((struct spi_dev_s *)priv, 400000);

  /* Enable the SPI peripheral */

  regval  = lpc54_spi_getreg(priv, LPC54_SPI_CFG_OFFSET);
  regval |= SPI_CFG_ENABLE;
  lpc54_spi_putreg(priv, LPC54_SPI_CFG_OFFSET, regval);

  return &priv->dev;
}

#endif /* HAVE_SPI_MASTER_DEVICE */
